코딩을 지탱하는 기술

제 1장
- 언어에 의존하지 않는 보편적인 지식의 습득이 중요하다
  언어를 배움에 있어 한 언어가 좋다고 말할 수 없다.
  언어를 배울 때 통용되는 이해를 배우는 것이 필요하다.

제 2장
- 나태함에서 나온 포트란 컴파일러
- 프로그래머의 삼대 미덕 나태: 수고를 덜고자 하는 것 조바심: 프로그램이 느린 것을 용납하지 않는 것 자만심: 틀린 것을 방치하지 않는 것
- 언어마다 다른 편리함에 대한 목표 -> 빠른 실행 속도? 언어의 사양 쉽게 파악? 가독성? C++은 빠른 실행 속도 -> 하지만 C보다 복잡해짐 Scheme은 언어 사양을 쉽게 파악할 수 있는데 중점 -> 수많은 괄호 python은 가독성 -> 속도 느림, 사양 복잡
  언어를 고를 때 유행에 편승하지 말고 자신이 어느정도 성과를 낼 수 있는 지를 봐야한다.

제 3장
컴파일러는 번역기다

제 4장
if else의 사용을 줄이자

제 5장
함수는 반복을 위한 것이다



























# cojigi
# cojigi
